In [1]:
import pandas as pd

In [40]:
# 문제 21
# '22년 1분기 매출액을 구하시오
# (매출액 = 판매수*개당수익)
# 데이터 생성(수정금지)
df = pd.DataFrame({
'날짜': ['20220103','20220105', '20230105','20230127','20220203', '20220205','20230210','20230223','20230312', '20230412', '20230430', '20230501'],
'제품' : ['A','B', 'A', 'B', 'A', 'B','A', 'B', 'A', 'B', 'A', 'A'],
'판매수': [3, 5, 5, 10, 10, 10, 15, 15, 20, 25, 30, 40],
'개당수익': [300, 400, 500, 600, 400, 500, 500, 600, 600, 700, 600, 600]})
df.head()

         날짜 제품  판매수  개당수익
0  20220103  A    3   300
1  20220105  B    5   400
2  20230105  A    5   500
3  20230127  B   10   600
4  20220203  A   10   400

In [15]:
df['날짜'] = pd.to_datetime(df['날짜'])

In [22]:
ddf = df[(df['날짜'].dt.strftime('%Y-%m') == '2022-01') | (df['날짜'].dt.strftime('%Y-%m') == '2022-02') | (df['날짜'].dt.strftime('%Y-%m') == '2022-03')]
ddf

          날짜 제품  판매수  개당수익
0 2022-01-03  A    3   300
1 2022-01-05  B    5   400
4 2022-02-03  A   10   400
5 2022-02-05  B   10   500

In [24]:
(ddf['판매수'] * ddf['개당수익']).sum()

11900

22년과 23년의 총 매출액 차이를 절대값으로 구하시오.

In [33]:
df['매출액'] = df['판매수'] * df['개당수익']
df

           날짜 제품  판매수  개당수익    매출액
0  2022-01-03  A    3   300    900
1  2022-01-05  B    5   400   2000
2  2023-01-05  A    5   500   2500
3  2023-01-27  B   10   600   6000
4  2022-02-03  A   10   400   4000
5  2022-02-05  B   10   500   5000
6  2023-02-10  A   15   500   7500
7  2023-02-23  B   15   600   9000
8  2023-03-12  A   20   600  12000
9  2023-04-12  B   25   700  17500
10 2023-04-30  A   30   600  18000
11 2023-05-01  A   40   600  24000

In [36]:
abs((df[df['날짜'].dt.year == 2022].매출액.sum()) - (df[df['날짜'].dt.year == 2023].매출액.sum()))

84600